{
  "Recipes":
  [
    {"RecipeName":"Breakfast Sandwich","RecipeDescription":"2 teaspoons extra virgin olive oil, divided 2 cups coarsely chopped baby spinach 1/2 teaspoon garlic powder Quarter teaspoon ground pepper, divided 1/8 teaspoon salt 1 large egg 1 wholegrain English muffin, toasted 2 tablespoons shredded extra sharp Cheddar cheese","TrailID":1,"RecipeDirection":"","RecipeTime":"","RecipeWebLink":"https://www.gmu.edu","RecipeImage":"https://raw.githubusercontent.com//sshafi6/IT315/main/sandwich.jpg"},
    {"RecipeName":"Breakfast Salad","RecipeDescription":"3 tablespoons salsa verde, such as Frontera brand 1 tablespoon plus 1 tsp. extra-virgin olive oil, divided 2 tablespoons chopped cilantro, plus more for garnish 2 cups mesclun or other salad greens 8 blue corn tortilla chips, broken into large pieces ½ cup canned red kidney beans, rinsed ¼ avocado, sliced 1 large egg","TrailID":2,"RecipeDirection":"STEP 1 Heat 1 teaspoon oil in a medium nonstick skillet over medium heat. Add spinach, garlic powder, 1/8 teaspoon pepper and salt; cook, stirring, until the spinach is wilted, 1 to 2 minutes. Transfer to a plate. STEP 2 Add the remaining 1 teaspoon oil to the pan. Break egg into the pan; sprinkle with the remaining 1/8 teaspoon pepper. Cook until set on the bottom, 1 to 2 minutes. Break the yolk, then flip the egg and cook, undisturbed, until set, about 1 minute more. STEP 3 Place the spinach on an English muffin half. Sprinkle with cheese, then top with the fried egg and remaining muffin half.","RecipeTime":"20 min.","RecipeWebLink":"https://www.gmu.edu","RecipeImage":"https://raw.githubusercontent.com//sshafi6/IT315/main/sandwich.jpg"},
    {"RecipeName":"Muesli with Raspberries","RecipeDescription":"⅓ cup muesli 1 cup raspberries ¾ cup low-fat milk","TrailID":3,"RecipeDirection":"STEP 1 Top muesli with raspberries and serve with milk.","RecipeTime":"2 min.","RecipeWebLink":"https://www.eatingwell.com/recipe/265712/muesli-with-raspberries/","RecipeImage":"https://raw.githubusercontent.com/sshafi6/IT315/blob/main/sandwich.jpg"},
    {"RecipeName":"Spinach-Avocado Smoothie","RecipeDescription":"1 cup nonfat plain yogurt 1 cup fresh spinach 1 frozen banana ¼ avocado 2 tablespoons water 1 teaspoon honey","TrailID":4,"RecipeDirection":"STEP 1 Combine yogurt, spinach, banana, avocado, water and honey in a blender. Puree until smooth.","RecipeTime":"10 min.","RecipeWebLink":"https://www.eatingwell.com/recipe/262759/spinach-avocado-smoothie/","RecipeImage":"https://raw.githubusercontent.com/sshafi6/IT315/blob/main/sandwich.jpg"},
    {"RecipeName":"Stovetop Veggie Frittata","RecipeDescription":"1 tablespoon canola oil 2 scallions, green and white parts separated, thinly sliced 1 cup frozen mixed veggies, such as broccoli, cauliflower, and carrots, roughly chopped ⅛ teaspoon salt 2 large eggs, lightly beaten (see Tips) 2 tablespoons shredded Cheddar cheese ½ whole-wheat English muffin, toasted 1 medium orange, cut into wedges","TrailID":5,"RecipeDirection":"STEP 1 Heat oil in an 8-inch nonstick skillet over medium-high heat. Add scallion whites, frozen veggies (do not thaw), and salt; cook, stirring occasionally, until lightly browned, 3 to 5 minutes. Stir in scallion greens. STEP 2 Pour eggs evenly over the vegetables and sprinkle with cheese. Cover tightly with a lid or foil and remove from heat. Let stand until the frittata is set and firm, 4 to 5 minutes. STEP 3 Serve with English muffin half and orange wedges.","RecipeTime":"15 min.","RecipeWebLink":"https://www.eatingwell.com/recipe/7885791/stovetop-veggie-frittata/","RecipeImage":"https://raw.githubusercontent.com/sshafi6/IT315/blob/main/sandwich.jpg"}
  ],
  "Status":"OK"
}
